      ******************************************************************
      * Author: VICENTE MBA ENGUNG
      * Date: DECEMBER 11, 2023
      * Purpose: PROJECT 3 - STUDENT REPORT
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROCESS-TRANSACTIONS.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT STUDENT-FILE
           ASSIGN TO "../STUFILE4.TXT"
           ORGANIZATION IS INDEXED
           ACCESS IS RANDOM
           RECORD KEY IS IND-STUDENT-NUMBER
           ALTERNATE RECORD KEY IS IND-TUITION-OWED WITH
           DUPLICATES
           FILE STATUS IS STATUS-FIELD.

       DATA DIVISION.
       FILE SECTION.
       *>STUDENT-FILE IS AN INDEXED INPUT FILE
       FD STUDENT-FILE.
       01 INDEXED-FILE-RECORD.
           05 IND-STUDENT-NUMBER  PIC 9(6).
           05 IND-TUITION-OWED    PIC 9(4)V99.
           05 IND-STUDENT-NAME    PIC X(40).
           05 IND-PROGRAM-OF-STUDY    PIC X(5).
           05 IND-COURSE-CODE-1   PIC X(7).
           05 IND-AVERAGE-1       PIC 9(3).
           05 IND-COURSE-CODE-2   PIC X(7).
           05 IND-AVERAGE-2       PIC 9(3).
           05 IND-COURSE-CODE-3   PIC X(7).
           05 IND-AVERAGE-3       PIC 9(3).
           05 IND-COURSE-CODE-4   PIC X(7).
           05 IND-AVERAGE-4       PIC 9(3).
           05 IND-COURSE-CODE-5   PIC X(7).
           05 IND-AVERAGE-5       PIC 9(3).

       WORKING-STORAGE SECTION.
       *>LOCAL VARS FOR STATUS CHANGING, LOOP CONTROL AND INDEX FETCHING
       01 STATUS-FIELD PIC X(2).
       01 FLAGS-AND-CONTROLS.
           05 TRANS-FLAG-WS PIC X(1).
           05 STUDENT-NUMBER-WS PIC 9(6).
           05 TUITION-OWED-WS PIC 9(5)V99.
           05 INPUT-DATA-FLAG PIC X(4).

       PROCEDURE DIVISION.
       *>MAIN ROUTINE
           PERFORM 201-INT-UPDATE-IND-STUDENT-FILE.
           PERFORM 202-UPDATE-INDEXED-STUDENT-FILE UNTIL
               TRANS-FLAG-WS = "N" OR TRANS-FLAG-WS = "n".
           PERFORM 203-END-UPDATE-IND-STUDENT-FILE.

           STOP RUN.

       *>200 ROUTINES
       *>INITIAL INDEXED FILE FOR I/O CONTROL
       201-INT-UPDATE-IND-STUDENT-FILE.
           PERFORM 701-OPEN-INDEXED-STUDENT-FILE.
       *>DISPLAY & ACCEPT TRANSACTION-FILE CONTENTS, ACCORDING STUDENT NUMBER AND TUITION VALUE TO SET FLAG VAR
       202-UPDATE-INDEXED-STUDENT-FILE.
           DISPLAY "ONLINE TRANSACTION".
           DISPLAY "TRANSACTION TO ENTER?".
           ACCEPT TRANS-FLAG-WS.

           IF TRANS-FLAG-WS = "Y" OR TRANS-FLAG-WS = "y"
               PERFORM 702-CHECK-ACCEPT-DATA
               IF INPUT-DATA-FLAG = "GOOD"
                   PERFORM 703-UPDATE-STUDENT-RECORD
               END-IF
           END-IF.
       *>TERMINATE PROGRAM
       203-END-UPDATE-IND-STUDENT-FILE.
           PERFORM 704-CLOSE-UPDATE-STUDENT-FILE.

       *>700 ROUTINES
       *>INITIAL STUDENT-FILE AND TRANS-FLAG-WS
       701-OPEN-INDEXED-STUDENT-FILE.
           OPEN I-O STUDENT-FILE.
           MOVE "Y" TO TRANS-FLAG-WS.
       *>ASSIGN FLAG VALUE BY JUDGING STUDENT NUMBER AND TUITION
       702-CHECK-ACCEPT-DATA.
           DISPLAY "STUDENT NUMBER?".
           ACCEPT STUDENT-NUMBER-WS.
           DISPLAY "TUITION OWNED?".
           ACCEPT TUITION-OWED-WS.

           IF STUDENT-NUMBER-WS = 111111 AND TUITION-OWED-WS = 500.00
               MOVE "GOOD" TO INPUT-DATA-FLAG
           ELSE IF STUDENT-NUMBER-WS = 411119 AND TUITION-OWED-WS = 50.00
               MOVE "GOOD" TO INPUT-DATA-FLAG
           ELSE
               MOVE "BAD" TO INPUT-DATA-FLAG
               DISPLAY "Input Data Invalid."
           END-IF.
       *>UPDATE FILE CONTENT
       703-UPDATE-STUDENT-RECORD.
           MOVE STUDENT-NUMBER-WS TO IND-STUDENT-NUMBER.
           READ STUDENT-FILE
               INVALID KEY DISPLAY "Record Not Found."
               NOT INVALID KEY PERFORM UPDATE-STUFILE-RECORD
           END-READ.

       UPDATE-STUFILE-RECORD.
           MOVE TUITION-OWED-WS TO IND-TUITION-OWED.
           REWRITE INDEXED-FILE-RECORD
               INVALID KEY DISPLAY "Record Not Found."
               NOT INVALID KEY DISPLAY "Record Updated."
           END-REWRITE.
       *>CLOSE FILE
       704-CLOSE-UPDATE-STUDENT-FILE.
           CLOSE STUDENT-FILE.

       END PROGRAM PROCESS-TRANSACTIONS.
