IDENTIFICATION DIVISION.
PROGRAM-ID. Create-ISAM-File.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT INVENT-FILE ASSIGN TO "input_inventory_file.txt".
    SELECT INDEXED-INVENT-FILE ASSIGN TO "indexed_inventory_file.dat"
        ORGANIZATION IS INDEXED
        ACCESS MODE IS DYNAMIC
        RECORD KEY IS INVENTORY-ID OF INVENTORY-RECORD-IN
        ALTERNATE RECORD KEY IS VENDOR-NAME OF INVENTORY-RECORD-IN.

DATA DIVISION.
FILE SECTION.
FD INVENT-FILE.
01 INVENTORY-RECORD-IN.
    05 INVENTORY-ID PIC X(9).
    05 VENDOR-NAME PIC X(20).
    05 INVENTORY-DESCRIPTION PIC X(40).

FD INDEXED-INVENT-FILE.

WORKING-STORAGE SECTION.
01 EOF-FLAG PIC X(3) VALUE "NO".

PROCEDURE DIVISION.
    PERFORM 100-CREATE-INVENTORY-FILE
    STOP RUN.

100-CREATE-INVENTORY-FILE.
    PERFORM 101-INITIALIZE-CREATE-FILE
    PERFORM UNTIL EOF-FLAG = "YES"
        PERFORM 202-READ-INVENT-FILE
        IF EOF-FLAG = "NO"
            PERFORM 203-WRITE-IND-INV-RECORD
    END-PERFORM
    PERFORM 103-TERMINATE-PROGRAM.

101-INITIALIZE-CREATE-FILE.
    OPEN INPUT INVENT-FILE
    OPEN OUTPUT INDEXED-INVENT-FILE.

202-READ-INVENT-FILE.
    READ INVENT-FILE
        AT END
            MOVE "YES" TO EOF-FLAG
    END-READ.

203-WRITE-IND-INV-RECORD.
    WRITE INVENTORY-RECORD-IN
        INVALID KEY
            DISPLAY "ERROR WRITING RECORD"
    END-WRITE.

103-TERMINATE-PROGRAM.
    CLOSE INVENT-FILE
    CLOSE INDEXED-INVENT-FILE.
