IDENTIFICATION DIVISION.
PROGRAM-ID. PAYROLL-PROCESS.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 PAY-TABLE-VALUES-TBL.
   05 PAY-VALUES-TBL OCCURS 5000 TIMES.
      10 JOB-TYPE-TBLE   PIC X(3).
      10 PAY-VALUE-TBLE  PIC 9(3)V99.

01 FLAGS-WORKING-FIELDS. 
   05 FOUND-FLAG        PIC X(3) VALUE "NO".
   05 SUB-1             PIC 9(4).
   05 JOB-TYPE-IN       PIC X(3).
   05 PAY-VALUE-EDITED  PIC $$$9.99.

PROCEDURE DIVISION.
    PERFORM ACCEPT-JOB-TYPE
    PERFORM SEARCH-AND-DISPLAY
    STOP RUN.

ACCEPT-JOB-TYPE.
    DISPLAY "Enter job type: ".
    ACCEPT JOB-TYPE-IN.

SEARCH-AND-DISPLAY.
    MOVE 1 TO SUB-1.
    SET FOUND-FLAG TO "NO".

    PERFORM VARYING SUB-1 FROM 1 BY 1
        UNTIL SUB-1 > 5000
        OR JOB-TYPE-TBLE(SUB-1) = SPACES
        IF JOB-TYPE-TBLE(SUB-1) = JOB-TYPE-IN
            PERFORM DISPLAY-PAY-VALUE
            EXIT PERFORM
        END-IF
    END-PERFORM.

    IF FOUND-FLAG = "NO"
        DISPLAY "Job type not found."
    END-IF.

DISPLAY-PAY-VALUE.
    MOVE PAY-VALUE-TBLE(SUB-1) TO PAY-VALUE-EDITED
    DISPLAY "Pay value: $" PAY-VALUE-EDITED.
