      ******************************************************************
      * Author: VICENTE MBA ENGUNG
      * Date: NOVEMBER 21, 2023
      * Purpose: PROJECT 2 ASSIGNMENT
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. STUDENT-REPORT.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT STUDENT-FILE-IN ASSIGN TO "../STUFILE-INDEXED.TXT"
           ORGANIZATION IS INDEXED
               ACCESS MODE IS SEQUENTIAL
               RECORD KEY IS STUDENT-NUMBER.
           SELECT PROGRAM-FILE-IN ASSIGN TO "../PROGRAM.TXT"
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT STUDENT-REPORT-OUT ASSIGN TO "../STUDENT-REPORT.TXT"
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD STUDENT-FILE-IN.
       01 STUDENT-RECORD.
           05 STUDENT-NUMBER  PIC 9(6).
           05 TUITION-OWED    PIC 9(6)V99.
           05 STUDENT-NAME    PIC X(40).
           05 PROGRAM-OF-STUDY    PIC X(6).
           05 COURSE-CODE-1   PIC X(7).
           05 AVERAGE-1       PIC 9(3).
           05 COURSE-CODE-2   PIC X(7).
           05 AVERAGE-2       PIC 9(3).
           05 COURSE-CODE-3   PIC X(7).
           05 AVERAGE-3       PIC 9(3).
           05 COURSE-CODE-4   PIC X(7).
           05 AVERAGE-4       PIC 9(3).
           05 COURSE-CODE-5   PIC X(7).
           05 AVERAGE-5       PIC 9(3).

       FD PROGRAM-FILE-IN.
       01 PROGRAM-RECORD.
         05 PORGRAM-CODE-IN PIC X(5).
         05 PROGRAM-NAME-IN PIC X(20).

       FD STUDENT-REPORT-OUT.
       01 STUDENT-REPORT-RECORD-OUT PIC X(80).

       WORKING-STORAGE SECTION.
       01 STUDENT-REPORT-RECORD.
           05 STUDENT-NAME-OUT PIC X(20).
           05 FILLER PIC X(1) VALUE SPACES.
           05 STUDENT-AVERAGE-OUT PIC 9(3).
           05 FILLER PIC X(20) VALUE SPACES.
           05 PROGRAM-NAME-OUT PIC X(20).
           05 FILLER PIC X(1) VALUE SPACES.
           05 TUITION-OWED-OUT PIC Z,ZZ9.99.

       01 COLUMN-HEADER.
           05 FILLER PIC X(12) VALUE "STUDENT NAME".
           05 FILLER PIC X(9) VALUE SPACES.
           05 FILLER PIC X(15) VALUE "STUDENT AVERAGE".
           05 FILLER PIC X(8) VALUE SPACES.
           05 FILLER PIC X(12) VALUE "PROGRAM NAME".
           05 FILLER PIC X(9) VALUE SPACES.
           05 FILLER PIC X(12) VALUE "TUITION OWED".

       01 FLAG-COUNTERS.
           05 EOF-FLAG PIC X(3) VALUE "NO".
           05 EOF-FLAG-TBL PIC X(3) VALUE "NO".
           05 READ-COUNTER PIC 9(3) VALUE ZERO.
           05 WRITE-COUNTER PIC 9(3) VALUE ZERO.
           05 SUB PIC 9(2).
           05 FOUND-FLAG PIC X(3) VALUE "NO".

       01 PROGRAM-NAMES-RECORDS.
           05 PROGRAM-TBL-RECORD OCCURS 20 TIMES.
               10 PROGRAM-CODE-TBL PIC X(6).
               10 PROGRAM-NAME-TBL PIC X(40).

       01 DISPLAY-COUNTERS.
           05 FILLER PIC X(14) VALUE "RECORDS READ: ".
           05 READ-COUNTER-OUT PIC 9(3).
           05 FILLER PIC X(18) VALUE "RECORDS WRITTEN: ".
           05 WRITE-COUNTER-OUT PIC 9(3).

       PROCEDURE DIVISION.
       PRODUCE-STUDENT-REPORTS.
           PERFORM INIT-STUDENT-REPORTS.
           PERFORM PRODUCE-ONE-STUDENT-REPORT
               UNTIL EOF-FLAG = "YES".
               PERFORM WRITE-COUNTERS.
           PERFORM TERMINATE-STUDENT-REPORT.
           STOP RUN.

       WRITE-COUNTERS.
           MOVE SPACES TO STUDENT-REPORT-RECORD.
           WRITE STUDENT-REPORT-RECORD-OUT FROM STUDENT-REPORT-RECORD.

       STRING "RECORDS READ: " READ-COUNTER DELIMITED BY SIZE
           "   "
           " RECORDS WRITTEN: " WRITE-COUNTER DELIMITED BY SIZE
           INTO STUDENT-REPORT-RECORD.

           WRITE STUDENT-REPORT-RECORD-OUT FROM STUDENT-REPORT-RECORD.

       INIT-STUDENT-REPORTS.
           PERFORM OPEN-FILES.
           PERFORM LOAD-PROGRAM-TBL
               VARYING SUB FROM 1 BY 1
                UNTIL EOF-FLAG-TBL = "YES"
                OR SUB > 20.
           PERFORM READ-STUDENT-RECORD.
           PERFORM WRITE-COLUMN-HDR.

       PRODUCE-ONE-STUDENT-REPORT.
           MOVE "NO" TO FOUND-FLAG.
           PERFORM CALCULATE-AVERAGE.
           PERFORM SEARCH-PROGRAM-NAME
               VARYING SUB FROM 1 BY 1
                UNTIL SUB > 20 OR FOUND-FLAG = "YES".
           PERFORM WRITE-STUDENT-REPORT.
           PERFORM READ-STUDENT-RECORD.

       TERMINATE-STUDENT-REPORT.
           PERFORM CLOSE-FILES.

       OPEN-FILES.
           OPEN INPUT STUDENT-FILE-IN
                      PROGRAM-FILE-IN.
           OPEN OUTPUT STUDENT-REPORT-OUT.
           DISPLAY "Read/Write successful!".

       LOAD-PROGRAM-TBL.
           READ PROGRAM-FILE-IN
               AT END MOVE "YES" TO EOF-FLAG-TBL
                      NOT AT END MOVE PROGRAM-RECORD
                                   TO PROGRAM-TBL-RECORD(SUB).

       WRITE-COLUMN-HDR.
           WRITE STUDENT-REPORT-RECORD-OUT FROM COLUMN-HEADER.

       READ-STUDENT-RECORD.
           READ STUDENT-FILE-IN
               AT END MOVE "YES" TO EOF-FLAG
                      NOT AT END ADD 1 TO READ-COUNTER
                           DISPLAY STUDENT-NUMBER
                                   PROGRAM-OF-STUDY.

       CALCULATE-AVERAGE.
           COMPUTE STUDENT-AVERAGE-OUT
             = (AVERAGE-1 + AVERAGE-2 + AVERAGE-3 +
             AVERAGE-4 + AVERAGE-5) / 5.

       SEARCH-PROGRAM-NAME.
           IF PROGRAM-OF-STUDY = PROGRAM-CODE-TBL(SUB)
               MOVE "YES" TO FOUND-FLAG
               MOVE PROGRAM-NAME-TBL(SUB) TO PROGRAM-NAME-OUT
           ELSE
               MOVE "NO" TO FOUND-FLAG
           END-IF.

       WRITE-STUDENT-REPORT.
           MOVE STUDENT-NAME TO STUDENT-NAME-OUT.
           MOVE TUITION-OWED TO TUITION-OWED-OUT.
           WRITE STUDENT-REPORT-RECORD-OUT FROM STUDENT-REPORT-RECORD.
           ADD 1 TO WRITE-COUNTER.

       CLOSE-FILES.
           CLOSE STUDENT-FILE-IN
                 PROGRAM-FILE-IN
                 STUDENT-REPORT-OUT.

       END PROGRAM STUDENT-REPORT.
